Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-DE/tmx_teil_3.tmx
Source language: de
Languages: en

source: Elektrische Geschirrtrockner für Haushaltszwecke
en: Electric dish drying machines for household purposes

source: Elektrische Weinkühler für Haushaltszwecke
en: Electric wine coolers for household purposes

source: Elektrische Wäschetrockner für Haushaltszwecke
en: Electric laundry dryers for household purposes

source: Trockenanlagen für die Landwirtschaft
en: Drying machines for agriculture

source: Elektrisch betriebene Geräte zum Kühlen
en: Electrically-operated devices used in cooling

source: Elektrisch betriebene Geräte zum Trocknen
en: Electrically operated devices used in drying

source: Elektrische Glühbirnen
en: Light bulbs, electric

source: Glühlichter [Glühbirnen]
en: Incandescent light bulbs

source: Schuh-Sterilisierungsgeräte für Haushaltszwecke
en: Shoe sterilizers for household purposes

source: Ultraschallsterilisatoren für den Haushalt
en: Ultrasonic sterilizers for household purposes

source: Geräte zum Erhitzen von Milch
en: Apparatus for heating milk

source: Geräte zum Erhitzen und Aufschäumen von Milch
en: Apparatus for making foam while heating milk

source: Lampen für Zelte
en: Lamps for tents

source: Heizgeräte für Bäder
en: Bathroom heaters

source: Tragbare Bidets
en: Portable bidets

source: Mit Gas betriebene Wäschetrockner
en: Gas laundry drying machines

source: Kühlgerät für Reis
en: Rice refrigerators

source: Elektrische Schuhtrockner für Haushaltszwecke
en: Electric shoe dryers for household purposes

source: Elektrische Weinkühler
en: Electric wine coolers

source: Transportable Klimaanlagen
en: Portable air conditioners

source: Elektrische Luftbefeuchter für Haushaltszwecke
en: Electric humidifiers for household use

source: Stehlampen
en: Floor lamps

source: Lichterketten für die Festtagsdekoration
en: Fairy lights for festive decoration

source: Gas-Wassererhitzer für Haushaltszwecke
en: Gas water heaters for household use

source: Trocknungsapparate für Chemiefasern
en: Chemical fiber drying apparatus

source: Trocknungsapparate für Tierfutter
en: Animal feed drying apparatus

source: Wassersparende Toiletten
en: Water-saving toilets

source: Wassersparende Duschköpfe
en: Water-saving showerheads

source: Wassersparende Belüfter für Wasserhähne
en: Water-saving aerators for faucets

source: Angepasste Stoffüberzüge für Dampfglätter
en: Fitted fabric covers for garment steamer heads

source: Angepasste Stoffüberzüge für Wärmflaschen
en: Fitted fabric covers for hot water bottles

source: Angepasste Stoffüberzüge für elektrische Toaster
en: Fitted fabric covers for electric toasters

source: Elektrische Samowars
en: Electric samovars

source: Elektrische Entfeuchter
en: Electric dehumidifiers

source: Elektrische Luftreiniger
en: Electric air purifiers

source: Nicht tragbare Kühlboxen für Haushaltszwecke
en: Non-portable ice chests for household use

source: Leuchtkabel für Beleuchtungszwecke
en: Luminous cables for lighting purposes

source: Luftbefeuchter mit Anionengenerator
en: Anion generating humidifiers

source: Beleuchungskörper für Gebäude
en: Architectural lighting fixtures

source: Halogen-Beleuchtungskörper für Bühnen
en: Halogen stage lighting fixtures

source: Halogen-Beleuchtungskörper für Gebäude
en: Halogen architectural lighting fixtures

source: Industrielle Beleuchtungskörper
en: Industrial lighting fixtures

source: Deckenfluter für Gebäude zur Installation im Boden
en: Architectural uplights for installation in the ground

source: Leuchtstoffleuchten für Bühnenbeleuchtung
en: Fluorescent luminaires for stage lighting

source: Leuchtstoffleuchten für architektonische Beleuchtung
en: Fluorescent luminaires for architectural lighting

source: Elektrische Lebensmitteldörrgeräte für Haushaltszwecke
en: Electric food dehydrators for household purposes

source: Lüftungsanlagen für Autos
en: Ventilators for automobiles

source: Batteriebetriebene elektrische Kerzen
en: Battery-operated electric candles

source: Pneumatikschläuche für Fahrzeugräder
en: Pneumatic inner tubes for vehicle wheels

source: Sitzerhöhungen für Kinder für Fahrzeuge
en: Vehicle booster seats for children

source: Fahrzeugsicherheitsgurte für Kinder
en: Children's safety belts for use in vehicles

source: Nichtmotorisierte Roller [Fahrzeuge]
en: Non-motorized scooters [vehicles]

source: Anti-Rutschketten für Fahrzeugreifen
en: Anti-skid chains for vehicle tires

source: Schläuche für Räder forstwirtschaftlicher Fahrzeuge
en: Inner tubes for the wheels of forestry vehicles

source: Kühlerhaubenabdeckungen als Bauteile von Fahrzeugen
en: Hood shields as structural parts of vehicles

source: Armstützen für Rollstühle
en: Arm rests for wheelchairs

source: Überzüge für Fahrradpedale
en: Covers for foot pedals on cycles

source: Lenkergriffe für Fahrräder
en: Covers for handgrips of cycles

source: Gehäuse für Teile von Landfahrzeugen [ausgenommen für Motoren]
en: Crankcases for land vehicle components, other than for engines

source: Kombination aus Wohnmobil und Pferdeanhänger
en: Combination camping recreational vehicle and horse trailer

source: Getriebe für Landfahrzeuge
en: Gear boxes for land vehicles

source: Elektrisch betriebene Rollstühle
en: Electrically operated wheelchairs

source: Sicherheitsgurte für Kraftfahrzeugsitzplätze
en: Seat safety harnesses for motor cars

source: Elektrische Lokomotiven mit eigener Stromerzeugung [dieselelektrische Lokomotiven]
en: Self-generating electric locomotives [diesel-electric locomotives]

source: Fahrzeuge mit integriertem Schaufellader
en: Vehicles incorporating bucket loaders

source: Getriebe [Teile von Landfahrzeugen]
en: Transmissions [land vehicle parts]

source: Radmuttern für Fahrzeugräder
en: Lug nuts for vehicle wheels

source: Kastenwagen zum Campen [Freizeitfahrzeuge]
en: Truck campers [recreational vehicles]

source: Schutzstreifen für Fahrzeugtüren
en: Protecting strips for vehicle doors

source: Fahrzeugreifen mit Spikes
en: Spiked tires for vehicles

source: Jalousien für Fahrzeugfenster
en: Jalousies for vehicle windows

source: Ventile für Fahrzeugreifen
en: Valves for vehicle tires [tyres]

source: Kleinteile für Fahrzeugbremsen
en: Brake hardware for vehicles

source: Bremsklötze für Landfahrzeuge
en: Brake pads for land vehicles

source: T-Bügel für Skilifte
en: T-bars for ski lifts

source: Ferngesteuerte Flugkörper
en: Remote controlled flying objects

source: Kunststoffstreben für Flugzeuge
en: Plastic struts for use on aircraft

source: Raketenmotoren für Landfahrzeuge
en: Rocket engines for land vehicle propulsion

source: Steuergeräte für Schiffe [ausgenommen automatische]
en: Ships' steering gear [other than automatic]

source: Gießwagen [Gießerei]
en: Casting carriages

source: Raupenfahrzeuge
en: Tracked vehicles

source: Wasserdichte Schutzhüllen [Kajakausrüstung]
en: Water deflecting skirts [kayak equipment]

source: Reibräder für Landfahrzeuge
en: Friction wheels for land vehicles

source: Elektrische Getriebemotoren für Landfahrzeuge
en: Geared electric motors for land vehicles

source: Differentialgetriebe für Landfahrzeuge
en: Differential transmissions for land vehicles

source: Wasserfahrzeuge mit Elektroantrieb
en: Electrically powered watercraft

source: Radaufhängungen
en: Wheel suspensions

source: Windschutzscheiben für Autos
en: Windscreens for motor cars

source: Bremstrommeln für Landfahrzeuge
en: Brake drums for land vehicles

source: Handbetätigte Trolleys
en: Hand propelled trolleys

source: Blendschutzvorrichtungen für Fahrzeuge
en: Anti-dazzle devices for vehicles

source: Unbemannte Förderfahrzeuge
en: Unmanned conveying vehicles

source: Propeller für Flieger
en: Propeller airplanes

source: Getriebe für Übersetzungsgetriebe von Landfahrzeugen
en: Gear boxes for hydraulic transmissions of land vehicles

source: Hupen für Kraftfahrzeuge
en: Horns for motor cars

source: Hydraulikkreisläufe für Kraftfahrzeuge
en: Hydraulic circuits for motor cars

source: Reibbeläge für Scheibenbremsen von Fahrzeugen
en: Disc brake friction pads for vehicle braking systems

source: Elektrische Warnanlagen zur Verhinderung von Diebstahl von oder aus Fahrzeugen
en: Electrically operated theft prevention installations for vehicles

source: Luftpumpen zum Aufpumpen von Fahrradreifen
en: Air pumps for bicycles for the inflation of tyres

source: Servomotoren für Landfahrzeuge
en: Servomotors for land vehicles

source: Bremshebel für Fahrzeuge
en: Brake levers for vehicles

source: Bremsteile für Fahrzeuge aus Materialien mit Reibeigenschaften
en: Brake parts (Vehicle -) made of materials having frictional properties

source: Motorroller für Behinderte und für Personen mit eingeschränkter Mobilität
en: Motorised scooters for the disabled and those with mobility difficulties

source: Airbags [Sicherheitsvorrichtungen für Autos]
en: Air bags [safety devices for automobiles]

source: Steuerräder und Steuerruder [für Wasserfahrzeuge]
en: Steering gears and rudders [for vessels]

source: Drehmomentwandler für Kraftfahrzeuge
en: Torque converters for motor cars

source: Rückenlehnen für Fahrzeugsitze
en: Backrests for vehicle seats

source: Faltbare Wasserfahrzeuge
en: Collapsible watercraft

source: Ausgleichszylinder für Bremsanlagen von Luftfahrzeugen
en: Compensating cylinders for the braking systems of airborne vehicles

source: Reifen für Nutzfahrzeuge
en: Tyres for commercial vehicles

source: Schlafwagen
en: Sleeping cars

source: Lokomotiven
en: Locomotives

source: Trittbretter für Fahrzeuge
en: Vehicle running boards

source: Nachverbrenner für Landfahrzeugmotoren
en: Afterburners for land vehicle engines

source: Nockenantriebssysteme für Motorfahrzeuge
en: Automotive cam drive systems for motor vehicles

source: Gabelkopfabdeckungen [Fahrradteile]
en: Fork crown covers [bicycle parts]

source: Felgenbremsen [Motorradteile]
en: Brake calipers [parts of motorcycles]

source: Bremsscheiben [Motorradteile]
en: Brake rotors [parts of motorcycles]

source: Kupplungsseile [Motorradteile]
en: Clutch cables [parts of motorcycles]

source: Scheinwerferhalter [Motorradteile]
en: Headlight mounts [parts of motorcycles]

source: Anhängerfahrgestelle für Fahrzeuge
en: Trailer chassis for vehicles

source: Ladebordwände für Fahrzeuge
en: Tail lifts for vehicles

source: Roller [für Transportzwecke]
en: Scooters [for transportation]

source: Mechanische Vorrichtungen zur Kraftübertragung für Landfahrzeuge
en: Mechanical power transmitting mechanisms for land vehicles

source: Mechanische Übersetzungsgetriebe für Landfahrzeuge
en: Mechanical transmissions for land vehicles

source: Zahnradgetriebe für Landfahrzeuge
en: Toothed gear transmissions for land vehicles

source: Handbremsenknäufe für Fahrzeuge
en: Handbrake knobs for vehicles

source: Schneeketten für Kraftfahrzeuge
en: Snow chains for motor vehicles

source: Schneeschlitten für Transportzwecke
en: Snow sledges for transportation

source: Radkappen
en: Hub caps

source: Militärfahrzeuge für den Transport
en: Military vehicles for transport

source: Laufflächen für die Runderneuerung der Reifen von Fahrzeugen für die Tiefbaubranche
en: Treads for retreading tyres for vehicles used in the civil engineering industry

source: Gepäcktaschen für Fahrräder
en: Panniers adapted for bicycles

source: Motorräder für Motocross
en: Motorcycles for motocross

source: Ruder
en: Oars

source: Selbstklebende Flickgummis für Reifenschläuche
en: Adhesive rubber patches for repairing inner tubes

source: Kühlergrills, nicht aus Metall, für Fahrzeuge
en: Radiator grills of non-metallic materials for vehicles

source: Sonnenblendschutzstreifen für Fahrzeuge
en: Anti-glare sunstrips for vehicles

source: Angepasste bewegliche Stützrahmen für Fahrzeuge
en: Articulated support frames adapted for use with vehicles

source: Zahnkränze für Motorradantriebe
en: Sprockets for motorcycle drives

source: Türbleche für Landfahrzeuge
en: Door panels for land vehicles

source: Fahrzeugsicherheitsgurte für Kraftfahrzeuge
en: Safety belts for vehicles for motor cars

source: Kugelgelenke [Fahrzeugteile]
en: Ball joints [vehicle parts]

source: Achsen für Luftfederungssysteme in Fahrzeugen
en: Axles for air suspension systems in vehicles

source: Drehmomentwandler für Landfahrzeuge
en: Torque converters for land vehicles

source: Bezüge für Fahrrad- oder Motorradsättel
en: Saddle covers for bicycles or motorcycles

source: Fahrzeugsicherheitsgurte für Kindersitze
en: Vehicle safety harness for safety seats for children

source: Kinderwagen mit Babytragetaschen
en: Perambulators incorporating carry cots

source: Antriebsketten [Fahrradteile]
en: Drive chains [bicycle parts]

source: Naben für Fahrzeugräder
en: Hubs for vehicle wheels

source: Akustische Rückfahrwarngeräte für Fahrzeuge
en: Sound alarms (Reversing -) for vehicles

source: Bremsbeläge
en: Brake facings

source: Bremsschuhe für Kraftfahrzeuge
en: Brake shoes for motor cars

source: Spoiler für Fahrzeuge
en: Spoilers for vehicles

source: Innenraumtaschen für Fahrzeuge
en: Interior pouches for vehicles

source: Klauenkupplungen für Landfahrzeuge
en: Jaw clutches for land vehicles

source: Bauteile von Fahrrädern
en: Structural parts of bicycles

source: Bezüge für Fahrzeuglenkräder
en: Covers for vehicle steering wheels

source: Insektenabweiser als Bauteile von Fahrzeugen
en: Bug shields as structural parts of vehicles

source: Dachgepäckträger für Kanus und Kajaks
en: Cartop canoe and kayak carrier kits

source: Kinderanhänger für Fahrräder
en: Child carrying trailers

source: Fahrzeuge mit Linearinduktionsmotorantrieb
en: Linear induction motor drive vehicles

source: Ferngesteuerte Schienenfahrzeuge
en: Remote controlled rail vehicles

source: Starre Muldenkipper
en: Rigid dump trucks

source: Fahrzeuge mit Raketenantrieb
en: Rocket-propelled vehicles

source: Fahrgetriebe für Landfahrzeuge
en: Rolling gearings for land vehicles

source: Tankdeckel für Landfahrzeuge
en: Gas caps for land vehicles

source: Benzintanks für Landfahrzeuge
en: Gas tanks for land vehicles

source: Kajaks
en: Kayaks

source: Dachplatten für Landfahrzeuge
en: Roof panels for land vehicles

source: Modulare Fahrgestellsysteme für Fahrzeuge
en: Modular chassis systems for vehicles

source: Antriebsketten für Motorräder
en: Chains for driving motorcycles

source: Doppelkupplungsgetriebe für Landfahrzeuge
en: Double clutch transmissions for land vehicles

source: Chassis für Landfahrzeuge
en: Framing for land vehicles

source: Glasscheiben für Landfahrzeuge
en: Glass panels for land vehicles

source: Nicht elektrische Kupplungsringe [Teile von Antrieben für Landfahrzeuge]
en: Coupling rings (non-electric -) [parts of land vehicle engines]

source: Angepasste Abdeckungen für Boote
en: Covers (Shaped -) for boats

source: Geländeketten für Fahrzeugräder
en: Cross country chains for vehicle wheels

source: Angepasste Kissen für Fahrzeugsitze
en: Cushions adapted for use with car seats

source: Klotzbremsen für Landkraftfahrzeuge
en: Brake blocks for land vehicles

source: Bremssättel für Landfahrzeuge
en: Brake calipers for land vehicles

source: Speziell an Wagen angepasste Halterungen für Werbung
en: Handles bearing advertising and adapted for trolleys

source: Kissen für Rollstühle
en: Wheelchair cushions

source: Laufräder für Fahrzeuge
en: Rolling wheels for vehicles

source: Ruderboot
en: Rowing boats

source: Gummiflicken zur Reparatur von Fahrzeugschläuchen
en: Rubber patches for repairing vehicle inner tubes

source: Fender für Wasserfahrzeuge
en: Fenders for water vehicles

source: Faltbare Fahrzeugverdecke
en: Folding hoods for vehicles

source: Selbstklebende Flickgummis für Schläuche oder Reifen
en: Adhesive rubber patches for repairing tubes or tires

source: Schaltgetriebe für Landkraftfahrzeuge
en: Gear changing mechanisms for land vehicles

source: Hubschrauber
en: Helicopters

source: Jachten
en: Yachts

source: Schalenrümpfe für Luftfahrzeuge
en: Monocoque structures for aircraft

source: Angepasste Sitzbezüge aus Perlen für Fahrzeuge
en: Shaped seat covers made of beads for use in vehicles

source: Angepasste Regale für Fahrzeuge
en: Shelves adapted for use in vehicles

source: Bremshebel für Fahrräder
en: Brake levers for cycles

source: Puffer für Stoßstangen
en: Buffers for vehicle bumpers

source: Steuerstände für Wasserfahrzeuge
en: Steering stands for marine vessels

source: Verdecke für Kraftfahrzeuge
en: Soft tops for motor vehicles

source: Dampflokomotiven
en: Steam locomotives

source: Radbremsen
en: Wheel brakes

source: Lenkergriffe [Fahrradteile]
en: Handle bar ends [bicycle parts]

source: Lenkerschaftrohre [Fahrradteile]
en: Handle bar stems [bicycle parts]

source: Distanzscheiben [Motorradteile]
en: Front spacers [parts of motorcycles]

source: Bremsklötze für Fahrzeuge
en: Brake blocks for vehicles

source: Satelliten für Transportzwecke
en: Satellites for transportation

source: Metallstangen als Masten für Wasserfahrzeuge
en: Metal poles being masts for watercraft

source: Fahrzeugaufbauten zum Kippen
en: Tipping bodies for vehicles

source: Spoiler für Kraftfahrzeuge
en: Spoilers for automotive vehicles

source: Hydraulische Bremsdruckregler für Fahrzeuge
en: Hydraulic brake pressure regulators for vehicles

source: Hydraulische Steueranlagen für Fahrzeuge
en: Hydraulic control systems for vehicles

source: Anhängerkupplungen für Landfahrzeuge
en: Hitches for use with motor land vehicles

source: Gepäckkarren auf Rädern
en: Wheeled luggage carriers

source: Schwenkachsen für Fahrzeuge
en: Loader swivel axles for vehicles

source: Lokomotiven für den Gütertransport
en: Locomotives for transporting freight

source: Gepäckträger zum Anbringen an Fahrzeugen
en: Luggage carriers for attachment to vehicles

source: Seitenwagen
en: Side cars

source: Düsenmotoren für Landfahrzeuge
en: Jet engines for land vehicles

source: Freilaufräder für Landfahrzeuge
en: Freewheels for land vehicles

source: Dachgepäckträger für Motorfahrzeuge
en: Luggage racks for motor cars

source: Kraftfahrzeuge für den Landtransport
en: Motor cars for transport on land

source: Fahrräder
en: Bicycles

source: Öffnungsmechanismus für Fahrzeugdächer
en: Opening mechanisms roofs for vehicles

source: Ersatzreifenträger für Fahrzeuge
en: Spare tire carriers for vehicles

source: Fahrtrichtungsanzeiger für Fahrzeuge
en: Direction signals for vehicles

source: Ritzel für Rennkartgetriebe
en: Sprockets for racing kart gearing

source: Stabilisatoren zur Reduzierung der Schiffsbewegung
en: Stabilisers for reducing the motion of ships

source: Anhänger für motorisierte Landfahrzeuge
en: Trailers for motor land vehicles

source: Rückspiegel [Fahrzeugteile]
en: Rearview mirrors [vehicle parts]

source: Lenkräder [Fahrzeugteile]
en: Steering wheels [vehicle parts]

source: Backenbremsen für Landfahrzeuge
en: Block brakes for land vehicles

source: Fahrzeuge mit integrierter Ladevorrichtung
en: Vehicles incorporating apparatus for loading

source: Fahrzeuge mit integrierter Kippvorrichtung
en: Vehicles incorporating apparatus for tipping

source: Krankenwagen
en: Ambulances

source: Ferngesteuerte Fahrzeuge
en: Remotely operated vehicles

source: Ölbehälter, nicht aus Metall [Fahrzeugteile]
en: Reservoirs (non-metallic -) [parts of vehicles]

source: Flicken für Reifenschläuche
en: Patches for inner tubes of tyres

source: Scheibenräder [Fahrradteile]
en: Disk wheels [bicycle parts]

source: Antriebsstränge [Fahrradteile]
en: Drive trains [bicycle parts]

source: Pontons
en: Pontoons

source: Schutzstreifen aus Gummi für Fahrzeugtüren
en: Protecting strips (Rubber -) for vehicle doors

source: Akustische Diebstahlalarmgeräte für Fahrzeuge
en: Audible alarms (Anti-theft -) for vehicles

source: Bremsanlagen für Fahrzeuge
en: Braking systems for vehicles

source: Scheibenwischer
en: Windshield wipers

source: Getriebemechanismen für Landfahrzeuge
en: Transmission mechanisms, for land vehicles

source: Linearmotoren für Landfahrzeuge
en: Linear motors for land vehicles

source: Tragende Teile für Fahrgestellrahmen von Fahrzeugen
en: Load bearing sections for chassis frames of vehicles

source: Verstärkungsbänder zur Verwendung in Fahrzeugkarosserieteilen
en: Reinforcement strips for use in panels for vehicles bodies

source: Automatikgetriebe für Landfahrzeuge
en: Automatic gearboxes for land vehicles

source: Rollcontainer [Transportwagen]
en: Roll containers [trolleys]

source: Bewegliche Ausrüstung für Drahtseilbahnen
en: Rolling stock for funicular railways

source: Doppelglasige Frontscheiben für Fahrzeuge
en: Double glass screens for vehicles

source: Getriebe zur Kraftübertragung bei Landfahrzeugen
en: Gear units for power transmissions of land vehicles

source: Griffe für Fahrradlenker
en: Bicycle handlebar grips

source: Handpumpen zum Aufpumpen von Fahrzeugreifen
en: Hand pumps for inflating vehicle tyres

source: Pinnenverbinder für Segelboote
en: Tiller connectors for use with yachts

source: Biegsame Wellen für Landfahrzeuge
en: Flexible shafts for land vehicles

source: Faltdächer für Kraftfahrzeuge
en: Folding roofs for motor vehicles

source: Tragfedern für Fahrzeuge
en: Vehicle suspension springs

source: Bauteile für die Außenkarosserie von Fahrzeugen
en: Components for the outer bodies of vehicles

source: Armaturen als Teile von Fahrzeuginnenräumen
en: Consoles being parts of vehicle interiors

source: Angepasste Behälter für Fahrzeugkofferräume
en: Containers adapted for use in vehicle boots

source: Schaltknäufe für Landfahrzeuge
en: Gear change knobs for land vehicles

source: Getriebekupplungen für Landfahrzeuge
en: Gear couplings for land vehicles

source: Turbinenflügel als Teil von Landfahrzeugmotoren
en: Turbine vanes being parts of land vehicle engines

source: Fahrbare Gabelstapler
en: Mobile fork lifts

source: Zahnstangen für Fahrzeuge
en: Steering racks for vehicles

source: Paddel [Kajakausrüstung]
en: Paddles [kayak equipment]

source: Wendegetriebe [für Landfahrzeuge]
en: Reversing gears [for land vehicles]

source: Sonnenschutz und Blendschutz für Autos
en: Sun shields and visors for motor cars

source: Rückfahrgetriebe für Landfahrzeuge
en: Back-gear transmissions for land vehicles

source: Kompensierungszylinder für die Bremsanlagen von Wasserfahrzeugen
en: Compensating cylinders for the braking systems of water vehicles

source: Fallschirme zum Stoppen von Fahrzeugen
en: Parachutes for arresting the motion of vehicles

source: Höhenversteller für Fahrgastsitze
en: Passenger seat height adjusters

source: Aerodynamische Teile von Fahrzeugkarosserien
en: Aerodynamic attachments for vehicle bodies

source: Tragflächen für Landfahrzeuge
en: Aerofoils for land vehicles

source: Traktoren für landwirtschaftliche Zwecke
en: Tractors for agricultural purposes

source: Automatisch gelenkte Fahrzeuge
en: Automatic guided vehicles

source: Gabeln [Fahrradteile]
en: Forks [bicycle parts]

source: Elektrische Getriebeschaltungen für Landfahrzeuge
en: Electric gear shifting apparatus for land vehicle motors

source: Elektrische Hupen für Fahrzeuge
en: Electric horns for vehicles

source: Elektromotoren für Rollstühle
en: Electric motors for wheelchairs

source: Elektrische Lokomotiven
en: Electric locomotives

source: Elektrische Lenkgetriebe [für Wasserfahrzeuge]
en: Electric steering gears [for vessels]

source: Waggonkippvorrichtungen [Teile von Waggons]
en: Tipping apparatus, parts of trucks and waggons

source: Spikes für Reifen
en: Spikes for tyres

source: Sonnenblenden als Teile von Fahrzeugkarosserien
en: Sun visors being parts of vehicle bodywork

source: Motoranlasser für Landfahrzeuge
en: Starter motors for land vehicles

source: Schutzleisten für Fahrzeugkarosserien
en: Protective strips for vehicle bodies

source: Pumpen zum Aufpumpen von Fahrradreifen
en: Pumps for inflating bicycle tyres
